In [ ]:
pandas

Immutable ndarray implementing an ordered, sliceable set. The basic object storing axis labels for all pandas objects.

index= row labels
every df has index and columns. They are their attributes.

In [3]:
import pandas as pd

In [2]:
pd.Index([1, 2, 3])

Int64Index([1, 2, 3], dtype='int64')

In [4]:
pd.Index(list('abc'))

Index(['a', 'b', 'c'], dtype='object')

In [5]:
df=pd.DataFrame({"col1": [1,2,3,4],
                "col2": [444,555,666,444],
                "col3": ["abc", "def", "ghi", "xyz"]})

In [6]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [7]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
df.index_col=0

In [10]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## What do I need to know about the pandas index? (Part 1)

Data School

In [53]:
drinks = pd.read_csv("http://bit.ly/drinksbycountry")

In [54]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [8]:
drinks.index

RangeIndex(start=0, stop=193, step=1)

In [10]:
drinks.columns# bunun çıktısı Index farklı: that is the type of object. It is not referred to as the index though.

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

Neither the index or the columns are considered part of the dataframe contents.

In [12]:
drinks.shape # number of columns are 6. not includes index.

(193, 6)

### default index and headers are like this: 1,2,3,..

In [21]:
pd.read_table("http://bit.ly/movieusers", header= None, sep="|").head()

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

In [22]:
"""Why Indexes exists: 3 Main reasons:
1. Identification
2. Selection
3. Alignment
"""

'Why Indexes exists: 3 Main reasons:\n1. Identification\n2. Selection\n3. Alignment\n'

#### Identification

Filter etsende index numarası değişmez.

In [55]:
drinks[drinks.continent=="South America"].head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
6,Argentina,193,25,221,8.3,South America
20,Bolivia,167,41,8,3.8,South America
23,Brazil,245,145,16,7.2,South America
35,Chile,130,124,172,7.6,South America
37,Colombia,159,76,3,4.2,South America

#### Selection

loc methodu ile selection yapılır.

In [56]:
drinks.loc[23, "beer_servings"]

245

Burda yine index numarasını bilmek zorundasın. Çok da yardımcı olmadı.

### set_index() metodu

In [57]:
drinks.set_index("country", inplace=True)
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [28]:
drinks.index

Index(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua & Barbuda', 'Argentina', 'Armenia', 'Australia', 'Austria',
       ...
       'Tanzania', 'USA', 'Uruguay', 'Uzbekistan', 'Vanuatu', 'Venezuela',
       'Vietnam', 'Yemen', 'Zambia', 'Zimbabwe'],
      dtype='object', name='country', length=193)

In [30]:
drinks.columns# country columndan gitti

Index(['beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [31]:
drinks.shape#sütun sayısı 5'e düştü.

(193, 5)

### Using df loc method

In [36]:
drinks.loc["Brazil", "beer_servings"]

245

**name** property of index

In [58]:
drinks.index.name = None
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

### reset_index() metodu

In [59]:
drinks.index.name = "country"#before resetting give the original name of index. Because pd decided what to call this column based upon the name of the index
drinks.reset_index(inplace=True)
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

### describe method

In [61]:
drinks.describe()# numerical sum, but it is dataframe, as such it has an index

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

In [63]:
drinks.describe().index

Index(['count', 'mean', 'std', 'min', '25%', '50%', '75%', 'max'], dtype='object')

In [64]:
drinks.describe().columns

Index(['beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol'],
      dtype='object')

### Interacting with the derived dfs

In [67]:
drinks.describe().loc["25%", "beer_servings"]

20.0

In [1]:
import pandas as pd

### How to Get Index of Pandas DataFrame?

In [7]:
df = pd.DataFrame([[88,72,67], [23,78,62], [55,54,76]], columns=["a", "b", "c"])
df

    a   b   c
0  88  72  67
1  23  78  62
2  55  54  76

In [8]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [12]:
for i in df.index:
    print(i)

0
1
2